:properties:
:ID: 20240206T010954
:end:
#+title:      KDOC 72: org-modeのHTMLエクスポート時に結果だけを表示する方法
#+date:       [2024-02-06 Tue 01:09]
#+filetags:   :code:
#+identifier: 20240206T010954

* この文書のステータス
:LOGBOOK:
CLOCK: [2024-02-06 Tue 20:50]--[2024-02-06 Tue 21:15] =>  0:25
CLOCK: [2024-02-06 Tue 20:19]--[2024-02-06 Tue 20:44] =>  0:25
CLOCK: [2024-02-06 Tue 19:53]--[2024-02-06 Tue 20:18] =>  0:25
:END:
- 作成
  - [X] 2024-02-06 貴島
- レビュー
  - [X] 2024-02-08 貴島
* 概要
[[id:7e85e3f3-a6b9-447e-9826-307a3618dac8][org-mode]]の機能の1つであるorg-babelでは、コードブロックを評価して結果をテキストに出力できる。これによってコードと結果を楽に残せる。[[id:9f5b7514-d5e5-4997-81b0-bd453775415c][HTML]]エクスポート時は結果だけを掲載したいときがある。そのときの書き方をまとめる。
* やりかた

コマンドを実行して、エクスポート先ではコマンド結果の日付だけを表示したいとする。

↓このままだと、[[id:9f5b7514-d5e5-4997-81b0-bd453775415c][HTML]]エクスポート時にコードブロックも表示される。

#+caption: エクスポート時にコードブロックと評価結果の両方がエクスポートされる
#+begin_src shell
,#+begin_src shell
date
,#+end_src

,#+RESULTS:
,#+begin_src
Tue Feb  6 07:55:58 PM JST 2024
,#+end_src
#+end_src

↓こうする。HTML_HEADをつけてコードブロック本体にCSSをつけて非表示にする。こうすることでHTMLエクスポート時は結果だけ表示されるようになる。

#+caption: エクスポート時に評価結果だけがエクスポートされる
#+begin_src shell
,#+HTML_HEAD: <style>.src { display: none; }</style>
,#+begin_src shell
date
,#+end_src

,#+RESULTS:
,#+begin_src
Tue Feb  6 07:55:58 PM JST 2024
,#+end_src
#+end_src
